app/views/posts/_post.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
   <p>
    <strong><%= pluralize post.comments.count, "comment" %></strong>