app/controllers/comments_controller.rb

  def create
    comment = @post.comments.create! comment_params
---
INSERT INTO "comments" ("post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 2], ["content", "React"], ["created_at", "2022-04-18 15:37:07.117033"], ["updated_at", "2022-04-18 15:37:07.117033"]]