app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "La maravilla de rails"], ["content", "Rails enamora muy fácil."], ["created_at", "2022-04-18 12:15:48.549040"], ["updated_at", "2022-04-18 12:15:48.549040"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-04-18 13:05:15.088981"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)